---
kind: type
id: T:Autodesk.Revit.DB.Part
source: html/1ee04db6-195f-58fa-a245-5a2f2d404200.htm
---
# Autodesk.Revit.DB.Part

This element represents a part of another element.

## Syntax (C#)
```csharp
public class Part : Element
```

## Remarks
A part is associated with a PartMaker element that creates it.